[
  {
    "path": "posts/2025-06-19-danger-tx-hb-4623-creates-financial-landmine-for-texas-school-board-trustees/",
    "title": "Danger! TX HB 4623 Creates Financial Landmine for Texas School Board Trustees",
    "description": "A new Texas law removes legal protections for school board trustees. Here's what volunteer board members need to know about their personal liability risks.",
    "author": [
      {
        "name": "Dan Swart",
        "url": "https://uncommonboardadvice.netlify.app"
      }
    ],
    "date": "2025-06-19",
    "categories": [
      "Education Policy",
      "Texas Politics",
      "School Governance"
    ],
    "contents": "\nSchool Board Trustees Had Better WATCH OUT! \nA new Texas law might change everything for school board trustees - for the worse. Here’s what you need to know.\nTexas House Bill 4623, if signed or allowed to take effect by Gov. Abbott, would apply to Trustees beginning September 1, 2025. It should create a lot of concern among school district trustees across the state. The new law is meant to create protections for those who suffer in the hands of child predators.\nA noble impulse, for sure. But, it creates new, huge financial risks to trustees in a process that might eliminate Trustees from school boards entirely. Personally, I don’t see why any trustee would take on that kind of personal financial risk.\nThis new law removes important legal protections that trustees have always needed to be able to serve. For people who volunteer their time to serve on school boards (obviously, without any pay), this change raises serious questions about service to a school district.\nOpinionated Executive Summary\n\nHB 4623 eliminates official immunity for school trustees in cases involving sexual misconduct or failure to report abuse\nTrustees face potential personal liability up to $500,000 per victim plus legal costs\nCurrent district insurance may not adequately protect trustees under this new law\nTrustees should review insurance coverage and consider personal D&O policies\nSome trustees may resign due to highly significant increased personal risk\nIn the future, districts must be able to demonstrate due professional care in hiring, supervision, and reporting procedures\n\nWhat Does HB 4623 Actually Do?\nThe law creates new ways for people to sue public schools and school employees when certain serious misconduct occurs. Specifically, it covers:\nSexual misconduct involving students\nFailure to report suspected child abuse or neglect\nHere’s the key part that affects trustees: The law specifically names “members of the board of trustees” as “professional school employees” who can be held personally responsible. This means trustees can be sued individually and held financially liable.\nThe Big Change: No More Legal Shield\nBefore this law, school trustees had something called “official immunity.” Think of it like a legal shield that protected them from personal lawsuits as long as they were acting in their official capacity. HB 4623 removes that shield entirely for the types of cases it covers.\nThe law also specifically waives “governmental immunity” for school districts, meaning districts can now be sued more easily. But here’s what makes this particularly dangerous for trustees: they can be named as individual defendants in lawsuits, creating personal liability that didn’t exist before.\nThe Financial Reality\nWhen a lawsuit is filed under this new law, trustees will immediately have several new financial risks:\nDamage Awards: Courts can award up to $500,000 per victim, plus court costs and attorney’s fees to winning plaintiffs.\nLegal Defense Costs: Defending against a lawsuit can cost tens of thousands of dollars, even if the trustee ultimately wins the case. (Does the term ‘lawfare’ sound familiar?)\nJoint and Several Liability: The law creates “joint and several liability,” meaning each defendant can potentially be responsible for the entire judgment, not just their portion.\nInsurance: The Current Landscape\nSchool districts can carry liability insurance that covers board members for typical governance activities. However, these policies may not fully protect trustees under the new law for several reasons:\nCoverage Gaps: Traditional policies often exclude intentional acts or criminal behavior. While a trustee might not have committed misconduct personally, they could still face claims about failure to properly hire or supervise.\nPolicy Limits: District insurance might not cover the full potential exposure, especially when multiple claims are involved.\nDefense Coverage: Some policies only cover defense costs if the insurance company believes coverage applies. If they deny coverage, trustees could be responsible for their own legal bills from day one.\nSeparate Legal Representation: When trustees and districts have conflicting interests in a lawsuit, trustees may need their own separate attorneys, which the district’s insurance might not cover.\nWhat About Director and Officer (D&O) Insurance?\nDistricts can purchase D&O insurance specifically for board members, but trustees should ask hard questions:\nDoes the policy cover claims under HB 4623?\nWhat are the coverage limits per claim and in total?\nDoes it cover defense costs even if coverage is ultimately denied?\nAre there exclusions that might apply?\nLegal Precedents and Protections\nUnfortunately, there aren’t many legal precedents that offer comfort to trustees in this situation. The law was specifically written to eliminate the traditional protections that might have helped in the past.\nSome potential defenses might include:\nArguing that a trustee’s actions didn’t rise to the level of “gross negligence” or “reckless” behavior\nDemonstrating that proper procedures were followed in hiring and supervision\nShowing that the trustee relied on professional recommendations from administrators\nHowever, these defenses would still require expensive legal representation to establish.\nWhat Should Trustees and Districts Do Now?\nFor Districts:\nReview Insurance Coverage: Work with insurance brokers to understand current coverage and identify gaps\nConsider Additional D&O Coverage: Purchase specific protection for board members if not already in place\nUpdate Policies: Strengthen hiring, supervision, and reporting procedures\nLegal Review: Have attorneys review current practices and recommend improvements\nTraining: Provide comprehensive training on the new law and proper procedures\nFor Individual Trustees:\nUnderstand Your Exposure: Ask direct questions about insurance coverage and personal liability\nDocument Everything: Keep detailed records of board discussions and decisions\nPersonal Insurance Review: Check whether homeowner’s or umbrella policies might provide any protection\nConsider Personal D&O Insurance: Some trustees may want to purchase individual policies\nStay Informed: Understand district policies and procedures thoroughly\nThe Resignation Question\nThe harsh reality is that some trustees may decide the risk isn’t worth it. Serving on a school board has always required significant time and effort. Adding substantial personal financial risk to an unpaid volunteer position changes the equation dramatically.\nConsider this: A successful lawsuit could result in personal liability of hundreds of thousands of dollars, plus legal defense costs that could easily reach six figures. For many middle-class volunteers, this represents a potentially devastating financial blow.\nWill There Be a Trustee Exodus?\nIt’s a real possibility. School boards across Texas are already struggling to find qualified candidates willing to serve. Adding significant personal liability risk could make recruitment even more difficult.\nRural districts might be hit particularly hard. They often have smaller candidate pools and less robust insurance coverage. Urban districts with better resources and insurance might weather the change more easily.\nMy Assessment of the Risk\nThe risk to trustees is real and significant. While the law targets serious misconduct, it’s written broadly enough that trustees could face claims based on hiring and supervision decisions - core responsibilities of any school board.\nThe most concerning aspect is that trustees must now factor personal financial ruin into their decision to serve. Even winning a lawsuit can be financially devastating due to legal costs.\nI Have to Ask…\nWhere was the Texas Association of School Boards (TASB) during this legislative session? Like everyone else, all focus was on two very large and important bills covering vouchers and vital school funding. Great energy was spent to mobilize ‘advocacy’ efforts to influence those two bills. This little gem seems to have escaped them. This is surprising because TASB usually does such a good job at keeping school districts informed about new and old legislation.\nThe Bottom Line\nHB 4623 fundamentally changes the risks for school trustees. While the law serves an important purpose in protecting students, it places huge, possibly insurmountable, new burdens on volunteer board members.\nDistricts and trustees need to take immediate action to understand and mitigate these risks. This includes reviewing insurance coverage, strengthening procedures, and ensuring proper training.\nSome trustees will likely decide the risk is too great and resign. Others may continue serving but demand better protection from their districts. The long-term impact on school governance in Texas remains to be seen.\nWhat’s certain is that the days of telling school boards not to micro-manage are over. Being a school trustee now requires understanding not just educational policy, but also significant legal and financial risks. Districts that want to keep quality board members will need to provide effective protection and support.\nIf the governor vetoes the bill there is nothing to worry about here. If no veto, the law takes effect September 1, 2025. Trustees and districts have little time to prepare, and they shouldn’t wait. The stakes are simply too high.\n\nThis analysis is for informational purposes only and should not be considered legal advice. Trustees and districts should consult with qualified attorneys and insurance professionals about their specific situations.\n\nIf you liked this post or found it valuable - share it with others.\nYour Thoughts?\nShare your perspective in the comments below. Use the ‘Sign in with GitHub’ button to verify you’re not a robot.\n\n\n\n",
    "preview": "posts/2025-06-19-danger-tx-hb-4623-creates-financial-landmine-for-texas-school-board-trustees/fined-in-court.jpg",
    "last_modified": "2025-06-19T17:34:30-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2025-04-20-selecting-a-board-president/",
    "title": "Selecting a Board President",
    "description": "(estimated time to read:  4 mins)",
    "author": [
      {
        "name": "Dan Swart",
        "url": "https://uncommonboardadvice.netlify.app"
      }
    ],
    "date": "2025-04-20",
    "categories": [],
    "contents": "\nMatching Officers and Board Members\nTwo Types of School Board Members\nBoard members usually come in two ‘flavors’:\nThose who expect the Superintendent to make most of the big decisions on district educational philosophy and policy. A good match for them is a ‘moderator’ personality for president. They believe ‘staying in their lane’ means a more passive approach to education philosophy and policy.\nThose who prefer a strong, independent board that makes its own decisions about educational philosophy and policy. A good match for them is a ‘process-leader’ personality for president. They envision the board taking a very proactive role in defining the district’s education philosophy.\nA ‘strong leader’ does NOT mean someone with a large personality that talks over everyone, imposes their personal opinions on the board, and shows off at public events. Actually, it’s the opposite of that.\nOpenly discuss the traits of a president that best serves your board at that particular point in time BEFORE the next office elections. (A board need not prefer a certain style forever) If the role of the board president is discussed before hand, the vote by the members will reflect the group preference, which should be respected.\nTwo Types of School Board Leaders\nThe Process-Focused Leader\nThe process-focused leader knows their main job is to orchestrate how the group makes decisions, not which particular decision is reached.\nThey know:\nTime is a very serious constraint\nMeetings should lead to good choices, given the trade-offs involved\nGroups go through specific steps to make decisions\nWhich step the group is at right now\nWhat the group needs to move ahead\nHow to guide talks toward good results\nWhich ideas fit with what the board stands for\nHow to help the group handle tough choices - they understand trade-offs\nProcess leaders watch the setting of each choice carefully. They know:\nClosed meetings only need to think about board member views\nPublic meetings must include community expectations\nSome choices have bigger public impact than others\nThe local politics of issues requiring board decision\nThese leaders know their fellow board members well. They meet with members to learn their:\nStrong and weak points\nViews on schools and learning\nGoals for now and the future\nImprovements they hope to see during their term\nThis helps leaders delegate the right tasks to the right people. They are decisive if the board is stuck.\nThe Participation-Focused Moderator\nThe Participation-Focused Moderator takes a hands-off approach. They focus on:\nMaking sure everyone gets to talk\nKeeping things “fair” above all else\nLetting talks go on with little direction\nAllowing stories and side talks\nWaiting until time runs out to force a choice\nThis often leads to:\nlong meetings with poor results\nChoices made when time runs out, not because they are good\nInconsistency between board goals, values, and actions\nMore worry about seeming fair than getting good results\nFinding a Process-Focused Leader\nLook for someone who:\nMeeting Skills\nCreates clear agendas that show what decisions need to be made\nAsks questions that help the group move forward\nGives brief summaries during meetings to show progress\nKeeps talks focused on what the board values\nPolitely brings off-topic talks back on track\nDecision-Making Abilities\nHas helped groups make tough choices before\nSpots when the group is stuck and offers solutions\nKnows when to gather more facts and when to decide\nHelps sort out what matters most when choices compete\nAlways ties issues back to how they affect students\nPeople Skills\nGets along well with most people\nThinks about the personalities of each board member relative to upcoming topics\nAppreciates how different members think about issues\nFinds what people agree on when views differ\nGives tasks to people based on what they do best\nSelf-Understanding\nKeeps personal views separate from their leader role\nListens more than they talk in meetings\nAsks how they could run meetings better\nChanges their approach based on what’s needed\nCan explain how they handle tough talks\nFinding a Participation-Focused Moderator\nLook for someone who:\nMeeting Skills\nKnows and follows rules of order\nGoes through agenda items in exact order\nPrefers open discussion over focused discussion\nApplies rules the same way for everyone\nDecision Approach\nRelies mainly on voting constraints to make choices\nMakes sure all views are heard before voting\nStays neutral on most topics\nRelies on meeting rules to get best results\nLets talks run their course without re-focusing\nPeople Skills\nTreats all board members the same way\nKeeps relationships formal and impersonal\nApplies rules the same for friends and others\nAvoids private talks with board business\nValues fair process over building bonds\nSelf-Expression\nOften shares their own views after decisions are made\nWastes time by repeating what others have said\nSpeaks firmly about rules and process\nOften mentions their own experiences\nTries to keep everyone happy\nScreen Your Candidates\nSample Questions To Identify Leadership Types:\n“Tell us about a time you helped a group agree on a hard choice.”\n“How do you get ready to lead a meeting with tough issues?”\n“What do you do when a group gets stuck?”\n“How do you let everyone speak but still reach a timely decision?”\n“How do you handle strong disagreements?”\n“What, to you, is situational awareness?”\n“How would you run public comment time on controversial topics?”\n“How do you make sure everyone gets equal time to speak?”\n“Should the president share their own views during talks?”\n“What is ‘situational awareness’ for a board leader?”\n“Is the amount of time served on a school board more important than leadership ability?”\nWatch How They Work\nNotice how potential presidents:\nRun committee meetings\nJoin in work sessions\nHandle when people disagree\nSum up complex ideas\nBalance listening and directing\nDeal with surprises\nFollow-up after meetings\nI’m sure you can think of other questions and methods to evaluate the type of candidate under consideration. It’s easier (emotionally and time-wise) to use a succession method of choosing a board president, but far less effective.\n\nThe Training Problem\nAs far as I know, Texas gives very little (or no) training for board members on:\nHow groups make good choices\nBalancing benefits, costs, trade-offs\nEvaluating evidence\nWays to guide and control discussion (hint: reliance on authority of office is a poor method)\nMoving groups smoothly toward decisions\nUsing each board member’s individual skills well\nThis means many boards get turn-takers when they need leaders.\nIf you liked this post or found it valuable - share it with others.\nYour Thoughts?\nShare your perspective in the comments below. Use the ‘Sign in with GitHub’ button to verify you’re not a robot.\n\n\n\n",
    "preview": "posts/2025-04-20-selecting-a-board-president/boss-vs-leader.jpg",
    "last_modified": "2025-06-19T17:35:17-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2025-04-17-ethics-of-unfunded-mandates/",
    "title": "Ethics of Unfunded Mandates",
    "description": "(estimated time to read:  4 mins)",
    "author": [
      {
        "name": "Dan Swart",
        "url": "https://uncommonboardadvice.netlify.app"
      }
    ],
    "date": "2025-04-17",
    "categories": [],
    "contents": "\n\n“The people cannot delegate to government the power to do anything which would be unlawful for them to do themselves.” ~ attributed to John Locke, the 17th-century English philosopher\n\nThe Mandate Paradox: What We Wouldn’t Allow As Individuals\nLet me ask you this: Would any of us consider it acceptable to force a family member to mortgage their home, hand over the money, then lose their home to foreclosure? Of course not. We’d recognize this as both unethical and illegal.\nYet as school board members, we collectively permit state legislatures to impose this equivalent burden on our districts. The question isn’t why they do it — it’s why we continue to accept it.\nBeyond “Unfair” - Calling It What It Really Is\n“Unfair” doesn’t adequately describe what’s happening. Unfunded mandates don’t discriminate — they burden ALL districts equally with the same impossible demands. The problem isn’t inequality of treatment; it’s the systematic undermining of public education through legislative actions.\nWhen our state legislature mandates programs without funding them, they create a fundamentally untenable situation — and many of them understand exactly what they’re doing.\nThe Structural Problems We Face Together\nAs fellow board members, we need to clearly recognize several critical issues:\nResponsibility Without Authority\nOur districts are ordered to implement programs while being denied the resources to properly execute them. We’re expected to make bricks without straw.\nJudge, Jury, and Prosecutor\nThe same legislative bodies that create unfunded mandates evaluate our performance in implementing them. This creates a no-win scenario for public schools.\nThe Public/Private Divide Widens\nPrivate schools operate free from these mandates, choosing what they can reasonably afford to offer. Meanwhile, our public districts must stretch limited resources across an ever expanding list of requirements.\nThe Illusion of Local Control\nLet’s be honest—“local control” has become largely symbolic in most states. Our boards spend more time figuring out how to comply with state directives than making meaningful decisions for our communities.\nProperty Tax Politics: Understanding the Game\nThe property tax cycle compounds our challenges:\nPoliticians campaign on property tax reduction\nThey implement these cuts to fulfill campaign promises\nOur districts lose critical funding when “hold harmless” guarantees aren’t fulfilled\nState funding often fails to replace these shortfalls\nWe’re forced to increase local taxes to fund state-mandated programs\nOur communities blame us for tax increases that originated at the state level\nWe still must meet all state requirements regardless of financial constraints\nWhen we inevitably struggle, we’re labeled as “failing”\nThis isn’t accidental — it’s a deliberate transfer of accountability that protects state-level politicians while putting local boards in an impossible position.\nThe Effect on Institutional Trust\nAs board members, we must acknowledge that legislators have broken faith with the public education system in several critical ways:\nPolitical Prioritization Over Educational Needs: Taxpayer funds meant to strengthen schools are routinely allocated based on political calculations rather than educational priorities.\nStrategic Underfunding: The consequences of denying inflation adjustments year after year are predictable and devastating to district operations. Similarly, unfunded mandates create financial strain that politicians understand but refuse to address.\nRhetorical Dishonesty: The gap between the stated support for “local control” and the practical elimination of meaningful local authority creates cynicism and distrust.\nConcealed Financial Impact: Tax cuts are presented as unmitigated positives without transparent acknowledgment of their educational consequences.\nAccountability Displacement: When our districts struggle with impossible expectations, responsibility is shifted to local leadership rather than the policies that created these conditions.\nAssessment Contradiction: Evaluating districts on mandated programs they weren’t given resources to implement properly violates basic principles of fairness.\nThe Ethical Obligation\nThe path forward is clear: funded mandates must become the standard. This reflects the fundamental principle of responsibility that we teach in our schools — if you create an obligation, you must provide the means to fulfill it.\nWhen state power is used to compel action without providing resources, it doesn’t just represent poor governance — it betrays the core purpose of public education.\nA Leadership Agenda\nAs board leaders, we can advocate for a more ethical and principled approach:\nAlign Resources with Responsibility: Every mandated program must include adequate funding for implementation.\nAuthentic Local Authority: Districts should have meaningful flexibility in achieving state educational goals.\nFinancial Transparency: All educational mandates must acknowledge their true costs and provide appropriate resources.\nReasonable Accountability: Districts should be evaluated based on factors within their actual control.\nTaking Decisive Action\nFellow board members, here’s what we can actually do:\nSupport Constitutional Protection: Work toward state constitutional amendments prohibiting unfunded mandates (as several states have successfully implemented).\nAdvocate for Mandate Oversight: Push for the creation of a “State Mandate Office” to document and ensure funding for mandated programs.\nSpeak the Political Truth: Abandon ineffective, deferential approaches to state legislators. Clear, direct communication about consequences is required.\nFrame the Issue Accurately: Help legislators understand that their actions represent a breach of trust with educational institutions and communities.\nRecognize Reality: Without structural change to remove the incentives for creating unfunded mandates, they will continue and likely increase.\nIf you liked this post or found it valuable - share it with others.\nYour Thoughts?\nShare your perspective in the comments below. Use the ‘Sign in with GitHub’ button to verify you’re not a robot.\n\n\n\n",
    "preview": "posts/2025-04-17-ethics-of-unfunded-mandates/unfunded-mandates.jpg",
    "last_modified": "2025-06-19T17:35:44-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2025-04-13-the-education-industrial-complex/",
    "title": "The Education-Government Complex",
    "description": "(estimated time to read:  4 mins)",
    "author": [
      {
        "name": "Dan Swart",
        "url": "https://uncommonboardadvice.netlify.app"
      }
    ],
    "date": "2025-04-11",
    "categories": [],
    "contents": "\n\nWow! Talk about making things more complicated!! You can avoid a lot of the cost and trouble these ‘solutions’ bring a district. The “education-government complex” isn’t inevitable - it’s a created market that benefits everyone except those it should serve: teachers and students.\n\nThe Education Money Machine: Following the Profit Trail\nHave you noticed something troubling in our education system? It’s become a perfect money-making machine — not for our students or teachers, but for companies selling “solutions” to problems created by government mandates.\nHere’s how this cycle works against our districts:\nLawmakers create extremely detailed mandates (like the TEKS in Texas)\nThese mandates are too complex for teachers to track on their own\nCompanies swoop in with expensive “solutions” to help schools comply\nOur districts must buy these products to meet state requirements\nMore mandates create more markets for more products\nWe — the taxpayers and districts—foot the bill while companies profit\nIt’s a perfect system if you’re selling the solutions, but a disaster if you’re teaching or learning.\n\nLet’s be honest with each other… when have you EVER purchased a ‘solution’ that actually made your education delivery system less complicated and more effective?\n\nComplexity By Design, Not Necessity\nI recently asked a fellow Superintendent why experienced teachers need to create detailed lesson plans. The one-word answer? “TEKS.”\nLet’s look at what’s happening in our classrooms:\nOur experienced math teachers already know how to teach algebra effectively\nNow they must document exactly how each lesson covers specific standards\nTEKS change constantly, making textbooks and lesson plans quickly outdated\nThis creates hours of paperwork that doesn’t improve actual teaching\nSoftware companies offer “alignment tools” that promise compliance\nOur districts buy these expensive programs because we have no choice\nOur teachers then spend valuable time feeding data into these systems instead of teaching\nThe state creates unnecessary complexity, and the marketplace responds with costly “solutions.” In effect, the state has become an unofficial partner in the software and textbook business.\nThe Education-Government Complex\nThis pattern mirrors what President Eisenhower called the “military-Government complex” — where government spending creates industries that then lobby for more spending. In our education system, we see:\n\nTable 1: The Education-Government Complex\nPlayer\nRole\nProfit_Source\nLawmakers\nCreate mandates requiring complex compliance\nPolitical support from companies that benefit\nEducation Agencies\nDevelop detailed regulations and reporting requirements\nLarger budgets to monitor compliance\nTesting Companies\nCreate and score tests aligned to state standards\nContracts for mandated state testing\nSoftware Vendors\nSell tracking systems for standards and student data\nSubscriptions to ‘compliance’ software\nConsultants\nHelp districts navigate complex requirements\nHigh-priced training on navigating mandates\nProfessional Development\nTrain teachers to use the new systems and standards\nRequired training for all teachers\n\nEveryone in this system benefits from more complexity - except our teachers and students.\nThe Real Costs to Our Educational Mission\nThis system damages our core educational mission in measurable ways:\nTeacher burnout: Our best educators leave when paperwork replaces teaching\nLost teaching time: Hours spent on compliance mean less time with students\nResource drain: Money spent on software could fund smaller classes\nFocus shift: The goal becomes meeting mandates, not helping students learn\nInnovation barriers: Creative teaching gets pushed aside by standardization\nTeacher shortages: Educators entered the profession to teach, not feed computers\nThe Empty Promises We Keep Buying\nThese products seduce districts with appealing promises:\n“Save time on lesson planning!”\n“Track student progress automatically!”\n“Ensure compliance with all state standards!”\n“Individualize learning with our algorithm!”\nBut we’ve all seen the disappointing reality:\nTeachers still spend hours inputting data into these systems\nThe “time-saving” tools create new forms of non-teaching work\nMuch of the data collected doesn’t actually improve instruction\nThe promised individualization rarely delivers meaningful results\nTaking Back Control Together\nHow can we break this cycle as district leaders? Here are strategies we can implement:\nPush for simpler standards: Advocate for fewer, clearer standards that experienced teachers can follow without special tools\nQuestion every purchase: When vendors pitch solutions, ask “Would this problem exist without the mandate?”\nCalculate true costs: Add up not just the software price but teacher time feeding these systems\nTrust our teachers: Give experienced educators more professional judgment in meeting learning goals\nExplore free alternatives: Many open-source tools can replace expensive proprietary systems\nQuestions Every Board Member Should Ask\nWhen faced with the next “essential” education software or textbook purchase, challenge assumptions with these questions:\n“Would we need this if state requirements were simpler?”\n“How much teacher time will this system consume?”\n“Could we meet our goals with existing tools or simpler approaches?”\n“Is this solving an educational problem or just a compliance problem?”\n“What evidence shows this improves actual student learning, not just compliance?”\nImagine a Different Future\nWhat if we worked together to create:\nLawmakers and bureaucrats who understand the true costs of their mandates—both financial and human\nDistricts that push back against unnecessary complexity by focusing resources where they actually improve teaching and learning\nCommunities that demand change at the ballot box\nAs board members and educational leaders, we must recognize this problem and take action. Our teachers, students, and communities deserve better than a system designed to generate profits rather than learning.\nIf you liked this post or found it valuable - share it with others.\nYour Thoughts?\nShare your perspective in the comments below. Use the ‘Sign in with GitHub’ button to verify you’re not a robot.\n\n\n\n",
    "preview": "posts/2025-04-13-the-education-industrial-complex/tx-legislature.jpg",
    "last_modified": "2025-06-19T17:36:10-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2025-04-06-self-inflicted-wounds-how-school-districts-hurt-themselves/",
    "title": "Self-Inflicted Wounds: How School Districts Hurt Themselves",
    "description": "(estimated reading time:  5 mins)",
    "author": [
      {
        "name": "Dan Swart",
        "url": "https://uncommonboardadvice.netlify.app"
      }
    ],
    "date": "2025-04-09",
    "categories": [],
    "contents": "\n\n“No man’s life, liberty or property are safe while the Legislature is in session.” ~ Gideon John Tucker\n\n\nCorrolary: God save us from PhD candidates with access to statistical software.\n\nEvery board can avoid these problems. They’re serious, but within our control.\nGood Intentions: The Hidden Burden on Our School Districts\nOur public education system is buckling under the weight of good intentions from all directions. Legislatures pile on mandates and so-called accountability requirements while funding shrinks. Politicians boast about their “improvements” to education with one hand while setting us up for failure with the other.\nWhy do legislatures everywhere create such destructive pressures on our districts? The culprit is almost always good intentions. Unfortunately, good intentions mean little when their real-world effects damage our districts and students.\nAs board members, we all recognize that many outside pressures are:\nUnnecessary (you can’t mandate desired outcomes - how’s that working for TEA so far?)\nDestructive (like pitting demographic groups against each other)\nImposed (at this point, “local control” has become an empty phrase)\nUnfunded (a destructive practice we must resist together)\nEven when we clearly identify these problems, persuading legislators that their “good intentions” are harmful remains challenging. It takes real courage to admit when your approach is wrong.\nSo we leave that battle to “Advocacy” (our polite term for hat-in-hand groveling).\nThe Mirror Test: Our Own Contributions\nHere’s an uncomfortable truth: we boards and administrators often increase burdens on our own districts. These are self-inflicted wounds—and we can avoid them starting today. Here are some time-wasters we can eliminate immediately:\n#1 - Stop Chasing “Best Practices”\nOur boards are frequently seduced by so-called “best practices,” a business cliché that has infected education. Like all buzzwords, it sounds impressive—who could oppose the “best” of anything?\nYet in actual operation, these imported practices often create unnecessary burdens on staff and volunteers. They can even subtly divide board members. Ask yourself: do we see more flowery language and virtue signaling before or after implementing these “best practices”?\nLet’s reserve “best practices” for purely clerical or simple compliance matters. For substantive policies, let’s be more thoughtful. Countless successful organizations thrived long before “best practices” became a catchphrase.\n#2 - Beware the “Good Governance” Trap\nThese represent the latest forms of Administrative Theater. They’ve even coined a new term: “Boardsmanship.” This approach functions as a “Bureaucratic Pacifier”—activities that calm anxieties without addressing real issues.\nIn practice, it attempts to convince boards that if we perform a checklist of activities, state them at meetings, and weave them into formal processes, test scores will magically improve. There’s no evidence showing one leads to the other.\nIn fact, logic suggests the causation might run in the opposite direction. The data equally supports the theory that families of high-scoring students are more likely to become board members. Successful students often have involved parents who join boards. What’s surprising isn’t that these claims remain unproven, but that convincing evidence is neither provided nor requested.\n#3 - Develop Your Own Solutions, Don’t Just Copy Others\nIt seems easier to copy others—no need to reinvent the wheel, right? But consider that these “best practices” developed elsewhere, with different people, priorities, methods, communities, and theories of practice.\nWhere did the first people with “best practices” find them? They didn’t purchase them from consultants. They developed them through self-examination, testing, measuring results, and refining THEIR specific approaches. They know from experience that for them, these are best practices.\nSince we have entirely different systems, people, and contexts, it’s unlikely those same practices will work better than ones we develop ourselves.\nThe REAL solution is taking time to develop practices that work for OUR people, in OUR district, with OUR resources.\nLet’s avoid copying others; it’s both risky and wasteful. Instead, let’s discover what works in our unique context, with OUR people, parents, students, community, facilities, and equipment. We’ll be more successful when we recognize that EVERY organization, including our own, is truly “one-of-a-kind.”\n#4 - Question “Evidence-Based” Claims\nSchool boards are particularly vulnerable to reassurances that policies are “evidence-based,” giving sales pitches a scientific appearance. This phrase effectively reassures the education community, though we should be skeptical when people emphasize something that should be standard practice.\nFew education professionals have the time, inclination, training, or experience to evaluate such claims critically.\nI rarely see challenges to these manipulative phrases outside technical journals. When was the last time your board training taught techniques for evaluating research claims? I’ve read numerous education research articles and doctoral dissertations with disappointingly little scholarship. Social sciences struggle with establishing true cause-and-effect in human populations, yet many claim otherwise.\nBefore adopting such recommendations, consider what “evidence-based” actually means and why the term exists. Remember that evidence once “proved” the earth was flat, that the earth was the center of the solar system, and that “bad air” spread disease. These “evidence-based” theories turned out completely wrong.\nMost “evidence-based” claims imply (or directly state) that following their recommendations will deliver promised benefits. At its best, evidence is robust and rigorous. At its worst, it’s weak and manipulative. Every prejudiced viewpoint claims to have “evidence,” but that doesn’t make it valid.\nThese claims may not withstand scientific scrutiny, but they certainly advance careers and consulting opportunities.\nImagine the Possibilities…\nPicture your district free from self-inflicted burdens, focused on what actually works for your unique community and circumstances.\nAs board members working together, we have the power to protect our districts from both external pressures and our own well-intentioned but harmful practices.\nYour Thoughts?\nShare your perspective in the comments below. Use the ‘Sign in with GitHub’ button so we know you’re not a robot.\n\n\n\n",
    "preview": "posts/2025-04-06-self-inflicted-wounds-how-school-districts-hurt-themselves/hitting-thumb-with-hammer.jpg",
    "last_modified": "2025-04-18T04:37:18-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2025-04-07-the-best-interests-of-the-child/",
    "title": "'The Best Interests of the Child'",
    "description": "(estimated time to read:  4 mins)",
    "author": [
      {
        "name": "Dan Swart",
        "url": "https://uncommonboardadvice.netlify.app"
      }
    ],
    "date": "2025-04-07",
    "categories": [],
    "contents": "\n\nOue aim is to solve problems…avoid trouble.\n\nBeyond “The Best Interests of the Child”: Finding Real Solutions\nThis seemingly innocent phrase can create serious problems for our boards. It’s another form of misrepresentation as it assumes we know far more than we possibly can. This expression has migrated from courtrooms into our schools, typically entering education through systems perceived as more rigorous. This simple-sounding phrase creates significant challenges when we use it to guide our decisions.\nThe Origin and Misapplication\nThis legal standard began in family law for custody decisions when children faced specific risks. In that narrow context, with individual children and particular circumstances, courts could at least attempt to evaluate tangible factors. Even there, many legal experts criticize it for being too subjective.\nIn our education system, the phrase becomes even more problematic when:\nApplied across thousands of different students simultaneously\nNot connected to specific, measurable results\nUsed by people without deep knowledge of individual children\nUsed as justification for almost any position\nThis Phrase Can Stop Productive Conversation\n“In the best interests of the child” functions primarily as a rhetorical device that:\nHalts discussion: Who among us would argue against children’s interests?\nClaims moral authority: Makes the speaker appear to be the true child advocate\nAvoids specificity: Never clearly defines what those interests actually include\nResists verification: Creates a standard that cannot be proven wrong\nThe phrase effectively serves as a blank check that stops conversation rather than encouraging it.\nThe Real-World Problems We Face\nFor us as board members, this phrase creates several practical challenges:\n1. It Lacks Clear Definition\nWhat exactly constitutes a child’s “best interest”? Does it mean:\nHigher test scores?\nEmotional well-being?\nFuture earning potential?\nCurrent happiness?\nSocial skills development?\nAlignment with family values?\nPreparation for citizenship?\nWithout specifying which interests take priority (and acknowledging they sometimes conflict), the phrase provides no real guidance for decision-making.\n2. It Ignores Necessary Resource Tradeoffs\nEducational decisions always involve tradeoffs. Our resources are limited, and focusing on one area means less attention to others:\n\n\nPriority\n\n\nPotential.Benefits\n\n\nPotential.Costs\n\n\nAcademic rigor\n\n\nContent mastery, college readiness\n\n\nStress, less time for other activities\n\n\nSocial-emotional support\n\n\nEmotional skills, relationship skills\n\n\nMay mean less academic content coverage\n\n\nArts education\n\n\nCreative expression, cultural appreciation\n\n\nMay mean fewer resources for core subjects\n\n\nAthletics\n\n\nPhysical health, teamwork\n\n\nBudget costs, injury risks\n\n\nVocational training\n\n\nPractical skills, career preparation\n\n\nMay mean fewer resources for traditional academics\n\n\nThe “best interests” phrase implies we can maximize everything simultaneously, which simply isn’t possible.\n3. It Assumes Universal Agreement\nThe phrase presumes we all share the same understanding of what’s best for children, when in reality:\nFamilies in our communities have different values and priorities\nOur communities have different needs and resources\nCultures represented in our districts have different expectations\nIndividual children have different strengths and challenges\nWhat one parent considers essential, another may view as harmful or unnecessary.\n4. It Often Conceals Adult Agendas\nPerhaps most troubling, the phrase frequently masks adult interests:\nPolitical agendas extending beyond education\nProfessional advancement opportunities\nAvoidance of difficult conversations\nProtection from criticism or legal action\nWhen these adult interests hide behind child-centered language, honest debate becomes impossible.\nThe Financial Accountability Problem\nFrom a budget perspective, “in the best interests of the child” is particularly problematic because it:\nRejects fiscal constraints as less important than children’s needs\nCreates moral pressure to approve spending without proper scrutiny\nMakes cost-benefit analysis appear uncaring or ‘anti-child’\nExpands district missions beyond core educational functions\nAs board members, we have a responsibility to manage public funds that cannot be abandoned for undefined “interests.”\nA Better Approach: Specificity and Transparency\nInstead of this vague, emotional phrase, we should require:\nSpecific goals: “This program aims to improve reading proficiency by X percentage points”\nClear measurements: “Success will be evaluated using these three indicators…”\nHonest tradeoffs: “Implementing this initiative means we’ll need to reduce resources for that…”\nEvidence: “Research indicates this approach works because…”\nResource requirements: “This will require X dollars and Y staff hours…”\nExamples of More Productive Discussions\nInstead of accepting:\n“We need this new social-emotional curriculum in the best interests of our children.”\nWe should ask:\nIs this properly the district’s responsibility?\nIs our district the best provider for this need?\nWhat specific results will improve?\nHow will we measure success?\nWhat tradeoffs are involved?\nWhat evidence supports its effectiveness? What resources will it require?”\nWhen This Phrase Appears in Discussions\nWhen someone uses “the best interests of the child,” we as board members should respond with:\n“Could you clarify which specific interests you’re addressing?”\n“How would we measure whether we’re advancing those interests?”\n“What evidence suggests this approach serves those interests better than alternatives?”\n“What tradeoffs should we consider in pursuing these particular interests?”\n“How do you balance competing interests that might conflict?”\nThe phrase “in the best interests of the child” signals either unclear thinking or potential manipulation. While children’s needs must remain central to our educational decisions, vague appeals to undefined “interests” hinder rather than help our governance.\nImagine the Difference…\nHow much more effective our boards could be if we moved from empty rhetoric to substantive dialogue:\nBy requiring specificity, evidence, and measurable results\nBy discussing tradeoffs honestly and openly\nBy establishing clear priorities that reflect our community’s values\nTogether, we can create decision-making processes that truly serve our students, families, and communities.\nYour Thoughts?\nShare your perspective in the comments below. Use the ‘Sign in with GitHub’ button so we know you’re not a robot.\n\n\n\n",
    "preview": "posts/2025-04-07-the-best-interests-of-the-child/no-cliches.jpg",
    "last_modified": "2025-04-20T14:07:51-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2025-04-05-squandering-your-most-precious-resource/",
    "title": "Don't Squander Your Most Precious Resource",
    "description": "(estimated time to read:  7 mins)",
    "author": [
      {
        "name": "Dan Swart",
        "url": "https://uncommonboardadvice.netlify.app"
      }
    ],
    "date": "2025-04-05",
    "categories": [],
    "contents": "\n\n“Children are the world’s most valuable resource, and the best hope for the future” ~ attributed to John F. Kennedy\n## Time: The True Resource Crisis in Education\n\n\n“Children are the world’s most valuable resource, and the best hope for the future” ~ attributed to John F. Kennedy\n\nThis soaring rhetoric works for politicians but creates serious problems for us as school board members. Fortunately, any board can avoid this particular trap.\nOur Ture ‘Most Valuable Resource’\nThe overused phrase “our children are our most valuable resource” sounds noble but leads to nothing but trouble. First, let’s be honest with each other - children are NOT resources, and they certainly don’t “belong” to our school districts. There was a time when more children meant more hands to work the fields, but those days are long gone.\nOne reason words like these create problems is because they promote a “blank check” mentality where no amount of time or money seems too much to spend in “the best interests of the child” (another overused phrase). Sometimes even our communities develop this impression from our board discussions.\nThe truth is, Time and Money are the only resources a Board actually controls.\nWith money, we try to purchase the best talent, wisdom, equipment, and facilities we can afford. After that, the only resource left is Time. There might be more money eventually. But the time spent each year will never return. No student, teacher, staff member, administrator, superintendent, or board member will ever get that time back. The “whatever it takes” mentality squanders the one truly nonrenewable resource available to our boards - TIME.\n\nConsider this irony: Politicians demand “Accountability” and extensive disclosure of all financial matters. What about “Accountability” for the time wasted by mandates that have nothing to do with direct instruction?\nOur state legislatures need an “Accountability Rating” that measures how much time their mandates consume that could have been spent teaching students. Imagine their faces when that report came out!\n\nThis practical principle offers a better framework than the old cliché. Let’s explore why this shift matters and where it could lead us.\nThe Hidden Costs of “Whatever It Takes”\nThe “whatever it takes” approach sounds virtuous but hides a damaging assumption: that time is infinite. This simply isn’t true. No one pretends Money is unlimited. So why do we act as if time has no bounds?\nHow this harms our districts:\nOur educators, staff, administrators, and board members burn out from endless demands\nQuality suffers as people stretch themselves thin\nImportant work receives the same priority as busywork\nReal costs remain hidden and unmanaged\nQuality of life declines for everyone involved in education\nA better approach\nTreating time as our most precious resource would transform education in our districts. The important questions would become:\nWill this task, mandate, policy, or strategy increase or reduce time spent in direct instruction?\nWill it add to or decrease time spent on compliance or administrative matters?\nWill this time commitment erode family and personal time?\nWhat existing programs will lose time because of this new effort?\nCentral planning makes the problem worse\nOver-regulation by state and federal education bureaucracies severely compresses time for our districts. Since money is limited, we cannot simply hire additional staff to handle new mandates. The only way our districts can maintain compliance is by taking more time from existing employees and volunteers.\nImagine a ‘Time-Conscious’ School Board\nIf we truly valued time as our scarcest resource, our meetings, planning, and operations would change dramatically:\nOur boards would find ways to conduct business responsibly with significantly tighter agendas\nWe would become ultra-sensitive to staff and administrators’ time commitments\nMost detailed “transparency” presentations could be condensed to executive summaries with supporting materials available separately\n“Soapbox” speeches would disappear\nMultiple activity reports from board members would be replaced by a single designated update\nEvery proposal would include a time impact analysis, not just financial assessments\n“Nice to have” initiatives would face additional scrutiny regarding their effects on other priorities\nValue-added activities (especially direct instruction) would receive protection\nThe shift from asking “Is this a ‘good’ thing to do?” to “Is this a smart thing to do considering the cost to everyone in time?” would transform our decision-making.\nThe Classroom Time Protection Act\nIf we truly valued our people’s time, we would treat teacher-student interaction like gold. We would:\nQuestion every pull-out from classroom teaching\nPush back against testing that doesn’t directly improve learning\nChallenge documentation requirements that don’t help students learn\nCreate buffers against administrative intrusions from the state\nMeasure compliance costs in teacher hours, not just dollars\nDevelop grading methods that use instructor time more effectively\nWhen a new state mandate arrives, our first question would be: “How many instructional hours will this consume?”\nTime As an Employee Benefit\nThere’s often an automatic assumption that increasing financial compensation will solve most staffing problems. While low pay contributes to teacher shortages and shouldn’t be ignored, the history of public education shows high intrinsic motivation among educators. People who prioritize maximum earnings don’t become K-12 teachers.\nIn our current environment of limited funding (thank you, state legislature), we do control another way to reward employees and volunteers—with time.\nWhen salaries keep pace with inflation, having breaks during the year provides adequate time for family and recharging. When salaries fall behind inflation, educators naturally increase their focus on money. However, time remains highly valued by educators as well.\nIn a mature system like education, it’s difficult to imagine things being different than they’ve “always been.” Yet boards with strong leadership can leverage time to great advantage for their districts.\nStrategies for Creating More Time\nThe best way to create more time is to become more effective. It’s proven that improving quality actually decreases costs, including time costs. Notice I didn’t say “efficient.” We can be 100% efficient at doing the wrong things—doing the wrong things “righter” doesn’t help anyone.\nBecoming more effective isn’t easy. It requires time, training, leadership, and commitment to examine and refine our systems of delivery, not just focusing on the people delivering services.\nWe cannot improve effectiveness without allocating time for that important work.\nWhat We Can Do Tomorrow\nIf our boards wanted to implement a time-conscious approach immediately, we could:\nAudit time costs: Request an honest accounting of where teacher time currently goes\nCreate time impact statements: Require all new initiatives to include time cost estimates\nSet time protection priorities: Identify core activities deserving time protection, including board meeting time\nPush back on unfunded time mandates: When the state requires new tasks, demand that existing requirements be eliminated or fully funded\nMake time gifts intentional: Consider “time back” as a deliberate benefit when raises aren’t possible\nGuarding Time Like Money\nPerhaps the most valuable shift would be normalizing statements like: “I don’t think this is worth the time drain on direct instruction.” Currently, this sounds almost heretical in education. But in fields where time is explicitly valued, it’s a normal part of prioritization.\nThe hardest but most important step is creating a culture where people can honestly assess whether an activity adds enough value to justify its time cost. This requires:\nStrong board leadership that supports members who question time-consuming activities\nClear priorities that help people make time allocation decisions\nLeaders who model time-conscious behavior themselves (especially during board meetings)\nRegular measurement of process efficiency, not just performance results\nValuing time as our most precious resource represents both practical wisdom and a potentially transformative approach to education. By shifting from “no price too high” to “is this worth the time investment given our students’ needs,” we can refocus on what truly matters: learning.\nThe greatest value we can provide our educational communities isn’t just more money (though that helps) - it’s recognizing that everyone’s time is finite and precious. When we truly act on that principle, both student achievement and educator satisfaction improve—not because we’re doing less, but because we’re doing less of what doesn’t matter.\nImagine if…\nOur boards had the courage to value Time as much as Money\nOur meetings became more focused and efficient\nOur relationship with employees and volunteers transformed through time respect\nYour Thoughts?\nShare your perspective in the comments below. Use the ‘Sign in with GitHub’ button so we know you’re not a robot.\n\n\n\n",
    "preview": "posts/2025-04-05-squandering-your-most-precious-resource/clock-and-hourglass-running-out.jpg",
    "last_modified": "2025-04-18T04:35:59-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2025-04-04-begin-with-the-truth/",
    "title": "Want to Improve?  Begin with the Truth",
    "description": "(estimated reading time:  5 mins)",
    "author": [
      {
        "name": "Dan Swart",
        "url": "https://uncommonboardadvice.netlify.app"
      }
    ],
    "date": "2025-04-04",
    "categories": [],
    "contents": "\nClear Communication: The Foundation for Everything Else\nPoor communication breaks our school systems. When messages are garbled between people, departments, campuses, or community groups, our entire educational system suffers - a lot! It would be difficult to overstate this problem.\nBy making a few simple word changes, our districts could immediately benefit from higher quality, lower costs, and less wasted effort. These changes would also create happier trustees, administrators, staff, teachers, parents, partners and students.\nSimple Words - Better Results (Words Matter More Than We Think)\nAs fellow board members, we already know this truth: simple words lead to better decisions and actions. The words we choose determine how effectively we communicate our principles and practices. School boards everywhere perform better when using clear, straightforward language.\nYet too often, we adopt vision statements, mission statements, and policies written by consultants who make their living selling the latest buzzwords and slogans. Some of our districts pay substantial amounts for these professionals to provide us with obscure terms and unrealistic promises. These words almost always make communication worse.\nLet’s be honest with each other - these fancy statements often contain subtle falsehoods. None of us truly believes that EVERY student will respond identically to district efforts. None of us believes that EVERY student will achieve equal results. None of us believes districts can make EVERY student graduate with specific state-defined characteristics. Even children in the same household, attending the same classes with the same teachers, can achieve wildly different results.\nBefore education became a pseudo-science, school boards spoke plainly. They were down-to-earth citizens trying to maintain their district as a fundamental community resource for those building their own lives in their own ways. Now, the education industry and legislature believe they should TELL us how to prepare our students for life.\nThe education industry feeds us these words under the flawed assumption that boards can control the final results of education. We cannot. While social pressure to follow such fantasies exists, our districts suffer from the dysfunction these statements create.\nWe must find our own words based on our own judgment of what our communities want - with our people, our resources, and our unique situations.\nIn simpler terms - Let’s Think for Ourselves. For decades, the collective wisdom of ordinary board members has produced the geniuses, wealth, heroes, inventions, and opportunities that made this country great.\nI believe the education industry would feel tremendous relief if the buzzwords, clichés, psycho-babble, corporate jargon, and weasel words disappeared tomorrow. They could return to their original purpose - education.\nWords That Overstate, Obscure, or Lack Common Meaning\nUsing such words represents a subtle form of misrepresentation. We should avoid this practice.\nHere’s an example:\nTypical of today - using obscure words that overstate our promises:\n“…to empower every student with the skills, confidence, and passion to thrive in their individual pursuits.”\nSounds impressive, doesn’t it?\nNow with simple, direct words that honestly state our capabilities:\n“…to provide the opportunity for each student to develop their abilities, self-assurance, and experience so they can follow any ambition they hold for themselves.”\nEveryone from trustees to students can understand what each word means and how it applies to them.\nThis clearer version establishes appropriate responsibilities: we will “provide the opportunity” for each student, not “empower” every student (which we cannot guarantee). Students and parents share responsibility for developing these attributes. We can only provide opportunities; we cannot promise specific results or “empowerment” (whatever that actually means).\nA Simple Word Test for Board Members\nIf you haven’t used a word during normal conversations at home or with friends in the last month, DON’T USE IT TO GOVERN YOUR DISTRICT!\nYou might feel out of step with current education trends, but if you’re serious about improving your school district eliminate the buzzwords, clichés, psycho-babble, and jargon from your materials, discussions, and reports.\n\nConsider this: When did you last use words like ‘empower,’ ‘circle back,’ ‘deep dive,’ ‘robust,’ or ‘outcomes’ around your kitchen table or while watching sports with friends? How about ‘boardsmanship’ or ‘actionable’?\n\nA Cautionary Tale\nWatch Out for Word Inventors\nWhen consultants or activists introduce new “solutions,” they create new terms hoping we’ll see their ideas as innovative and essential. Often these words have technical meanings in business or other fields but no common usage in education. For example, current “word inventors” group trustees, administrators, staff, teachers, parents, partners, and students (actual human beings) into the sterile category of “stakeholders.”\nWhile “stakeholders” is shorter than listing each group, should we treat all these people the same way? If you believe they’re all alike, keep using “stakeholders.” If you recognize they’re distinct groups requiring different considerations, stop using that term.\n\nConsider this: The urge to exaggerate reminds me of someone who thinks their name lacks importance, so they add “Captain” to it!\nHave you noticed how being a diligent, steady worker is no longer enough? Now you must have passion. The passion typically belongs to the person insisting on using that word!\n\nImagine a Better World\nWhat message do we send students when we adopt slogans, goals, and statements that are idealistic rather than realistic? They soon realize that the adults in charge must be smoking something!\nImagine board meetings where we have confidence that our district’s aims, principles, and methods are understandable and achievable. (For example, we can know if we’re providing opportunities; we cannot know how each opportunity will unfold for each student in the future.)\nImagine a district where:\nThe board’s aims and methods can be clearly communicated to Superintendents\nThe district’s aims and methods can be clearly communicated to employees\nClear communication facilitates the work between grade levels, campuses, and departments\nAs board members working together, we have the power to make all out communication clearer, simpler, and more effective. We, and our communities, deserve nothing less.\nYour Thoughts?\nShare your perspective in the comments below. Use the ‘Sign in with GitHub’ button so we know you’re not a robot.\n\n\n\n",
    "preview": "posts/2025-04-04-begin-with-the-truth/words-have-power.jpg",
    "last_modified": "2025-04-18T04:36:32-05:00",
    "input_file": {}
  }
]
